{
  "logic": {
    "component": {
      "title": "Logika",
      "description": "Jeden z komponentów, odpowiedzialny za logike programu.",
      "versions": {
        "firstVersion": {
          "firstParagraph": {
            "title": "Opis komponentu",
            "description": "Komponent składa się z klas oraz interfejsów.",
            "p": [
              "Każda z klas jest odzwierciedleniem figury geometrycznej",
              "Każda z klas posiada implementuje interfejs nakazujący zaimplementowanie metod takich jak obliczenie pola czy obwodu figury.",
              "Każda z klas posiada prywatne pola, które są udostępnione w projekcie poprzez gettery oraz settery za pośrednictwem Lomboka."
            ]
          },
          "secondParagraph": {
            "title": "Circumference() oraz Area()",
            "description": "Dwie metody, których zadaniem jest zwrócenie wartości obliczonego pola oraz obwodu danej figury.",
            "img": "square.png"
          },
          "ThirdParagraph": {
            "title": "IOperation",
            "description": "Interfejs zawierające dwie powyższe metody.",
            "img": "interf1.png"
          }
        },
        "secondVersion": {
          "firstParagraph": {
            "title": "Rozszerzona wersja komponentu",
            "description": "W drugiej wersji komponentu zaimplementowany został nowy interfejs pozwalający obliczyć objetość bryły a co za tym idzie zostały dodane również nowe figury."
          },
          "secondParagraph": {
            "title": "Volume()",
            "description": "Metoda zwracająca obliczoną objętość danej bryły",
            "img": "cone.png"
          },
          "ThirdParagraph": {
            "title": "IOperationThreeDimensional",
            "description": "Interfejs odpowiedzialny za implementacje objętości dla brył",
            "img": "interf2.png"
          }
        }
      },
      "tests" : {
        "firstTest": {
          "title": "Obliczanie pola figury",
          "description": "Został stworzony obiekt kwadratu o dlugiści boków 5cm. Po czym uruchomiona została metoda Area()",
          "expectations": "Metoda powinna zwrócić wartość obliczonego pola kwadratu, która w zadanym teście wynosi 25cm2",
          "result": "Wartość zwrócona przez program zgadza się z tą zadaną. Pole kwadratu wynosi 25cm2"
        },
        "secondTest": {
          "title": "Obliczenie obwodu figury",
          "description": "Został stworzony obiekt prostokąta o długościach boków 3cm i 5cm. Po czym uruchomiona została metoda Circumference()",
          "expectations": "Metoda powinna zwrócić obliczoną wartość obwodu prostokąta, która w zadanym teście wynosi 16cm",
          "result": "Wartość zwrócona przez program zgadza się z tą zadaną. Obwód prostokąta wynosi 16cm"
        },
        "thirdTest": {
          "title": "Obliczenie objętości bryły",
          "description": "Został stworzony obiekt stożka o wysokości 6cm i promieniu 2cm. Po czym uruchomiona została metoda Volume()",
          "expectations": "Metoda powinna zwórić obliczoną wartość obwodu stożka, która w zadanym teście w przybliżeniu wynosi 25.13cm3",
          "result": "Wartość zwrócona przez program zgadza się z tą zadaną. Objętość stożka wynosi 25.13cm3"
        }
      }
    }
  }
}
